package jv1610.hometasks.simple_data_types.task1;

/**
 *
 * @author Владимир Литовченко
 * 
 * Задание 1
 * 1. Cоздать программу, которая выводит в консоль текст "Здравствуй мир".
 * 2. Создать в программе текстовую переменную (String) с произвольным текстом
 *    размещенную на нескольких строках кода. Вывести текст в консоль.
 */
public class App {
        public static void main(String[] args) {
        
        System.out.println("Здравствуй мир");
               
        String a = "My name"
                + " is "
                + "Vladimyr";  
        System.out.println(a);
    }
}
