package base_types.task1;

/**
 *
 * @author Владимир Литовченко
 * 
 *  Создать программу, которая выводит в консоль текст "Здравствуй мир".
 *  При выполнении задания использовать числовые типы данных, строки, 
 * оперировать выходными данными на уровне сложения строк, сложения строк и 
 * числовых данных.
 */
public class App1 {
    public static void main(String[] args) {
        String a = "Здравствуй мир";
        System.out.println(a);
    }
}
