package base_types.task1;

/**
 *
 * @author admin
 * 
 *  Создать в программе текстовую переменную (String) с произвольным
 * текстом размещенную на нескольких строках кода. Вывести текст в консоль.
 *  При выполнении задания использовать числовые типы данных, строки, 
 * оперировать выходными данными на уровне сложения строк, сложения строк и 
 * числовых данных.
 */
public class App2 {
    public static void main(String[] args) {
        String a = "My name"
                + " is "
                + "Vladimyr";  
        System.out.println(a);
    }
}
