package basic_constructions;

/**
 *
 * @author Владимир Литовченко
 * 
 * С помощью арифметических операций, операций сравнения и конструкций 
 * if­else и циклических операций создать приложение которое:  
 * -в последовательности чисел от 0 до 100 выводит все значения кратные 2, 3, 5, 7  
 * - находит сумму чисел для каждой из этих последовательностей 
 * - вычисляет разность сумм последовательности чисел, кратных 7 и 2 
 * - вычисляет отношение последовательности чисел, кратных 5 к 
 * последовательности чисел, кратных 3 
 */
public class App1 {
    public static void main(String[] args) {
        double b = 0;
        double c = 0;
        double d = 0;
        double e = 0;
///////////////////////////////////////////////////////////////////////////////////////////        
        System.out.print("Числа, кратные 2 из последовательности от 0 до 100: ");
        for(int i=0; i<=100; i++){
            if(i%2 == 0){
                System.out.print(" "+i+" " );
                b += i;
            }
        }
        System.out.println();
        System.out.println("Сумма чисел, кратных 2 из последовательности от 0 до 100: " + b);
        System.out.println();
/////////////////////////////////////////////////////////////////////////////////////////////        
        System.out.print("Числа, кратные 3 из последовательности от 0 до 100: ");
        for(int i=0; i<=100; i++){
            if(i%3 == 0){
                System.out.print(" "+i+" " );
                c += i;
            }
        }
        System.out.println();
        System.out.println("Сумма чисел, кратных 3 из последовательности от 0 до 100: " + c);
        System.out.println();
////////////////////////////////////////////////////////////////////////////////////////////
        System.out.print("Числа, кратные 5 из последовательности от 0 до 100: ");
        for(int i=0; i<=100; i++){
            if(i%5 == 0){
                System.out.print(" "+i+" " );
                d += i;
            }
        }
        System.out.println();
        System.out.println("Сумма чисел, кратных 5 из последовательности от 0 до 100: " + d);
        System.out.println();
///////////////////////////////////////////////////////////////////////////////////////////        
                System.out.print("Числа, кратные 7 из последовательности от 0 до 100: ");
        for(int i=0; i<=100; i++){
            if(i%7 == 0){
                System.out.print(" "+i+" " );
                e += i;
            }
        }
        System.out.println();
        System.out.println("Сумма чисел, кратных 7 из последовательности от 0 до 100: " + e);
        System.out.println();
////////////////////////////////////////////////////////////////////////////////////////////      
        System.out.println("Разность сумм последовательности чисел, кратных 7 и 2: " + (e-b));
        System.out.println("Отношение последовательности чисел, кратных 5 к последовательности чисел, кратных 2: " + (d/c));
    }
}
